### Terraform Result 📝️ `mysql_instance_with_read_replica`
#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙ ️`success`
#### Terraform Validation 🤖

```
Success! The configuration is valid.


```

#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.instance_suffix will be created
  + resource "random_id" "instance_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # random_id.random_string will be created
  + resource "random_id" "random_string" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 12
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.google_compute_global_address_private_ip.google_compute_global_address.default_network will be created
  + resource "google_compute_global_address" "default_network" {
      + address            = (known after apply)
      + address_type       = "INTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = (known after apply)
      + network            = (known after apply)
      + prefix_length      = 16
      + project            = (known after apply)
      + purpose            = "VPC_PEERING"
      + self_link          = (known after apply)
    }

  # module.google_compute_network_private_network.google_compute_network.vpc_network will be created
  + resource "google_compute_network" "vpc_network" {
      + auto_create_subnetworks         = true
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + internal_ipv6_range             = (known after apply)
      + mtu                             = 0
      + name                            = (known after apply)
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # module.google_service_networking_connection_private_vpc_connection.google_service_networking_connection.network will be created
  + resource "google_service_networking_connection" "network" {
      + id                      = (known after apply)
      + network                 = (known after apply)
      + peering                 = (known after apply)
      + reserved_peering_ranges = (known after apply)
      + service                 = "servicenetworking.googleapis.com"
    }

  # module.sql_database.google_sql_database.database will be created
  + resource "google_sql_database" "database" {
      + collation = (known after apply)
      + id        = (known after apply)
      + instance  = (known after apply)
      + name      = "db-first"
      + project   = (known after apply)
      + self_link = (known after apply)
    }

  # module.sql_database_instance.google_sql_database_instance.instance will be created
  + resource "google_sql_database_instance" "instance" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "MYSQL_8_0"
      + deletion_protection            = false
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = (known after apply)
      + private_ip_address             = (known after apply)
      + project                        = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = (known after apply)
      + self_link                      = (known after apply)
      + server_ca_cert                 = (known after apply)
      + service_account_email_address  = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "REGIONAL"
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = 10
          + disk_type             = "PD_SSD"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-f1-micro"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + backup_configuration {
              + binary_log_enabled             = true
              + enabled                        = true
              + point_in_time_recovery_enabled = false
              + start_time                     = "03:00"
              + transaction_log_retention_days = 5

              + backup_retention_settings {
                  + retained_backups = 10
                  + retention_unit   = "COUNT"
                }
            }

          + database_flags {
              + name  = "cloudsql_mysql_audit"
              + value = "ON"
            }

          + ip_configuration {
              + ipv4_enabled    = false
              + private_network = (known after apply)
              + require_ssl     = false
            }

          + location_preference {
              + follow_gae_application = (known after apply)
              + secondary_zone         = (known after apply)
              + zone                   = (known after apply)
            }
        }
    }

  # module.sql_database_instance.google_sql_database_instance.read_replica[0] will be created
  + resource "google_sql_database_instance" "read_replica" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "MYSQL_8_0"
      + deletion_protection            = false
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = (known after apply)
      + private_ip_address             = (known after apply)
      + project                        = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = (known after apply)
      + self_link                      = (known after apply)
      + server_ca_cert                 = (known after apply)
      + service_account_email_address  = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "ZONAL"
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = 10
          + disk_type             = "PD_SSD"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-f1-micro"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + backup_configuration {
              + binary_log_enabled             = false
              + enabled                        = false
              + start_time                     = (known after apply)
              + transaction_log_retention_days = (known after apply)

              + backup_retention_settings {
                  + retained_backups = (known after apply)
                  + retention_unit   = (known after apply)
                }
            }

          + database_flags {
              + name  = "cloudsql_mysql_audit"
              + value = "ON"
            }

          + ip_configuration {
              + ipv4_enabled    = true
              + private_network = (known after apply)
              + require_ssl     = false
            }

          + location_preference {
              + follow_gae_application = (known after apply)
              + secondary_zone         = (known after apply)
              + zone                   = (known after apply)
            }
        }
    }

  # module.sql_user.google_sql_user.users will be created
  + resource "google_sql_user" "users" {
      + host     = "%"
      + id       = (known after apply)
      + instance = (known after apply)
      + name     = "sql-user"
      + password = (sensitive value)
      + project  = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + random_string                                                    = (known after apply)
  + sql_database_instance_master_connection_name                     = (known after apply)
  + sql_database_instance_master_first_ip_address                    = (known after apply)
  + sql_database_instance_master_instance_name                       = (known after apply)
  + sql_database_instance_master_private_ip_address                  = (known after apply)
  + sql_database_instance_master_public_ip_address                   = (known after apply)
  + sql_database_instance_master_self_link                           = (known after apply)
  + sql_database_instance_master_service_account_email_address       = (known after apply)
  + sql_database_instance_read_replica_connection_name               = (known after apply)
  + sql_database_instance_read_replica_first_ip_address              = (known after apply)
  + sql_database_instance_read_replica_instance_name                 = (known after apply)
  + sql_database_instance_read_replica_private_ip_address            = (known after apply)
  + sql_database_instance_read_replica_public_ip_address             = (known after apply)
  + sql_database_instance_read_replica_self_link                     = (known after apply)
  + sql_database_instance_read_replica_service_account_email_address = (known after apply)
  + sql_database_master_id                                           = (known after apply)
  + sql_database_master_self_link                                    = (known after apply)
  + sql_user_name                                                    = "sql-user"
  + sql_user_password                                                = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @poom, Action: `pull_request`, Working Directory: ``, Workflow: `terraform`*